#โจทย์ข้อที่ 1 Input / Print-----------------------------
name = input("เขียนชื่อของคุณ :")
print( "สวัสดี", name )
#-----------------------------------------------------

#ข้อ2 รับคะแนนสอบ → แสดงผลว่า "คุณสอบผ่าน" หรือ "คุณสอบไม่ผ่าน" (ใช้ if / else)
score = int(input("บอกเกรดของคุณ : "))   #ต้องแปลง input เป็น “เลข” ก่อนด้วย int()
if score >= 95 :
    print("ได้ A ดีเยี่ยมผ่าน!!!")
elif score >= 80 :
    print("ได้ B ดีผ่าน")
elif score >= 70 :
    print("ได้ C ปรับปรุง")
elif score >= 60 :
    print("ได้ D ปรับปรุงแก้ไข")
elif score >= 50 :
    print("ได้ D ปรับปรุงด่วนๆ!!!")
else :
    print("ได้ F ไม่ผ่าน !!!")
#------------------------------------------------------

#ข้อ 3 เด็ก / วัยรุ่น / ผู้ใหญ่
age = int(input("กรอกอายุของคุณ"))
if age <= 13 :
    print("คุณเป็นเด็ก !!!")
elif age <= 19 :
    print("คุณคือวัยรุ่น")
else :
    print("คุณเป็นผู้ใหญ่")
#-------------------------------------------------------

#ข้อ 4 โปรแกรมเทียบตัวเลข 2 ตัว (ใหญ่กว่า / น้อยกว่า / เท่ากัน)
#โจทย์:รับเลข 2 ตัวจากผู้ใช้ → บอกว่าเลขไหนใหญ่กว่าหรือถ้าเท่ากัน ให้บอกว่า "เท่ากัน"
num1 = int(input("บอกตัวเลขที่ 1 : "))
num2 = int(input("บอกตัวเลขที่ 2 : "))
if num1 > num2 :
    print("อันนี้ใหญ่กว่า : " , num1 )
elif num1 < num2 :
    print("อันนี้น้อยกว่า : " , num1 )
else :
    print("อันนี้เท่ากัน : " , num1 , num2 )
#-------------------------------------------------------------

#ข้อ 5: โปรแกรมบอกฤดูจากตัวเลขเดือน รับเดือน 1–12 (เป็นตัวเลข) แล้วบอกว่าเป็นฤดูไหน
#มีนาคม–พฤษภาคม = ฤดูร้อน มิถุนายน–ตุลาคม = ฤดูฝน พฤศจิกายน–กุมภาพันธ์ = ฤดูหนาว ใช้: int(input()) if / elif / else
month = int(input("บอกเลขเดือนแล้วจะบอกฤดูให้ : "))
if 3 <= month <= 5:
    print("ฤดูร้อนจร้า")
elif 6 <= month <= 10:
    print("ฤดูฝนจร้า")
elif 1 <= month <= 12:
    print("ฤดูหนาวจร้า")
else:
    print("เดือนผิดนะ 1-12 เท่านั้น")
#----------------------------------------------------------------------